Revit 2027 API
Space.BaseOffset Property
Get or set the Base Offset of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseOffset { get; set; }
Public Property BaseOffset As Double
	Get
	Set
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
member BaseOffset : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Base Offset of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace